railsng/app/controllers/books_controller.rb

SELECT books.id, books.name, books.remark, categories.name as category,id_categories FROM "books" INNER JOIN categories ON categories.id = books.id_categories
---
  def index
    @books = Book.joins("INNER JOIN categories ON categories.id = books.id_categories ").select("books.id, books.name, books.remark, categories.name as category,id_categories")

INSERT INTO "books" ("name", "id_categories", "remark", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aljabar"], ["id_categories", 3], ["remark", "ohhh man"], ["created_at", "2018-03-29 13:47:40.587072"], ["updated_at", "2018-03-29 13:47:40.587072"]]
---
  def create
    @book = Book.new(book_params)

    if @book.save

UPDATE "books" SET "name" = $1, "id_categories" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["name", "Great Dictator"], ["id_categories", 2], ["updated_at", "2018-03-29 15:53:50.592138"], ["id", 8]]
---
  def update
    if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 7]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def delete
    Book.where(id: params[:uri_segment1]).delete_all

SELECT  books.id, books.name, books.remark, categories.name as category, id_categories FROM "books" INNER JOIN categories ON categories.id = books.id_categories WHERE "books"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_book
      @book = Book.joins("INNER JOIN categories ON categories.id = books.id_categories ").select("books.id, books.name, books.remark, categories.name as category, id_categories").find(params[:id])