railsng/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "comic"], ["created_at", "2018-03-29 16:57:58.444786"], ["updated_at", "2018-03-29 16:57:58.444786"]]

  def update
    if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "politicx"], ["updated_at", "2018-03-29 16:47:17.489593"], ["id", 2]]